## staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:37:29.763 STDOUT terraform:   + create
15:37:29.763 STDOUT terraform: Terraform planned the following actions, but then encountered a problem:
15:37:29.763 STDOUT terraform:   # newrelic_alert_policy.terraform_notify_policy[0] will be created
15:37:29.763 STDOUT terraform:   + resource "newrelic_alert_policy" "terraform_notify_policy" {
15:37:29.763 STDOUT terraform:       + account_id          = (known after apply)
15:37:29.763 STDOUT terraform:       + id                  = (known after apply)
15:37:29.763 STDOUT terraform:       + incident_preference = "PER_POLICY"
15:37:29.763 STDOUT terraform:       + name                = "Notify Policy - staging"
15:37:29.764 STDOUT terraform:     }
15:37:29.764 STDOUT terraform:   # newrelic_notification_channel.terraform_notify_channel[0] will be created
15:37:29.764 STDOUT terraform:   + resource "newrelic_notification_channel" "terraform_notify_channel" {
15:37:29.764 STDOUT terraform:       + account_id     = (known after apply)
15:37:29.764 STDOUT terraform:       + active         = true
15:37:29.764 STDOUT terraform:       + destination_id = (known after apply)
15:37:29.764 STDOUT terraform:       + id             = (known after apply)
15:37:29.764 STDOUT terraform:       + name           = "Notify Slack Channel - staging"
15:37:29.764 STDOUT terraform:       + product        = "IINT"
15:37:29.764 STDOUT terraform:       + status         = (known after apply)
15:37:29.764 STDOUT terraform:       + type           = "SLACK_LEGACY"
15:37:29.764 STDOUT terraform:       + property {
15:37:29.764 STDOUT terraform:           + key           = "payload"
15:37:29.764 STDOUT terraform:           + label         = "Payload Template"
15:37:29.764 STDOUT terraform:           + value         = jsonencode({})
15:37:29.764 STDOUT terraform:             # (1 unchanged attribute hidden)
15:37:29.764 STDOUT terraform:         }
15:37:29.764 STDOUT terraform:     }
15:37:29.764 STDOUT terraform:   # newrelic_notification_destination.terraform_notify_destination[0] will be created
15:37:29.764 STDOUT terraform:   + resource "newrelic_notification_destination" "terraform_notify_destination" {
15:37:29.764 STDOUT terraform:       + account_id = (sensitive value)
15:37:29.764 STDOUT terraform:       + active     = true
15:37:29.764 STDOUT terraform:       + guid       = (known after apply)
15:37:29.764 STDOUT terraform:       + id         = (known after apply)
15:37:29.764 STDOUT terraform:       + last_sent  = (known after apply)
15:37:29.764 STDOUT terraform:       + name       = "Notify Slack Destination - staging"
15:37:29.765 STDOUT terraform:       + status     = (known after apply)
15:37:29.765 STDOUT terraform:       + type       = "SLACK_LEGACY"
15:37:29.765 STDOUT terraform:       + property {
15:37:29.765 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
15:37:29.765 STDOUT terraform:           # so its contents will not be displayed.
15:37:29.765 STDOUT terraform:         }
15:37:29.765 STDOUT terraform:     }
15:37:29.765 STDOUT terraform:   # newrelic_workflow.terraform_notify_workflow[0] will be created
15:37:29.765 STDOUT terraform:   + resource "newrelic_workflow" "terraform_notify_workflow" {
15:37:29.765 STDOUT terraform:       + account_id            = (sensitive value)
15:37:29.765 STDOUT terraform:       + destinations_enabled  = true
15:37:29.765 STDOUT terraform:       + enabled               = true
15:37:29.765 STDOUT terraform:       + enrichments_enabled   = true
15:37:29.765 STDOUT terraform:       + guid                  = (known after apply)
15:37:29.765 STDOUT terraform:       + id                    = (known after apply)
15:37:29.765 STDOUT terraform:       + last_run              = (known after apply)
15:37:29.765 STDOUT terraform:       + muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
15:37:29.765 STDOUT terraform:       + name                  = "Notify Workflow - staging"
15:37:29.765 STDOUT terraform:       + workflow_id           = (known after apply)
15:37:29.765 STDOUT terraform:       + destination {
15:37:29.765 STDOUT terraform:           + channel_id              = (known after apply)
15:37:29.765 STDOUT terraform:           + name                    = (known after apply)
15:37:29.765 STDOUT terraform:           + notification_triggers   = [
15:37:29.765 STDOUT terraform:               + "ACKNOWLEDGED",
15:37:29.765 STDOUT terraform:               + "ACTIVATED",
15:37:29.765 STDOUT terraform:               + "CLOSED",
15:37:29.765 STDOUT terraform:             ]
15:37:29.765 STDOUT terraform:           + type                    = (known after apply)
15:37:29.765 STDOUT terraform:           + update_original_message = true
15:37:29.765 STDOUT terraform:         }
15:37:29.765 STDOUT terraform:       + issues_filter {
15:37:29.765 STDOUT terraform:           + filter_id = (known after apply)
15:37:29.765 STDOUT terraform:           + name      = "workflow-filter"
15:37:29.766 STDOUT terraform:           + type      = "FILTER"
15:37:29.766 STDOUT terraform:           + predicate {
15:37:29.766 STDOUT terraform:               + attribute = "labels.policyIds"
15:37:29.766 STDOUT terraform:               + operator  = "EXACTLY_MATCHES"
15:37:29.766 STDOUT terraform:               + values    = (known after apply)
15:37:29.766 STDOUT terraform:             }
15:37:29.766 STDOUT terraform:           + predicate {
15:37:29.766 STDOUT terraform:               + attribute = "priority"
15:37:29.766 STDOUT terraform:               + operator  = "EQUAL"
15:37:29.766 STDOUT terraform:               + values    = [
15:37:29.766 STDOUT terraform:                   + "CRITICAL",
15:37:29.766 STDOUT terraform:                 ]
15:37:29.766 STDOUT terraform:             }
15:37:29.766 STDOUT terraform:         }
15:37:29.766 STDOUT terraform:     }
15:37:29.766 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
15:37:25.053 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
15:37:29.766 STDERR terraform: Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
15:37:29.766 STDERR terraform:   with data.newrelic_entity.notification-api-lambda[0],
15:37:29.766 STDERR terraform:   on data.tf line 1, in data "newrelic_entity" "notification-api-lambda":
15:37:29.766 STDERR terraform:    1: data "newrelic_entity" "notification-api-lambda" {
15:37:29.766 STDERR terraform: Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
15:37:29.766 STDERR terraform:   with data.newrelic_entity.notification-admin[0],
15:37:29.766 STDERR terraform:   on data.tf line 12, in data "newrelic_entity" "notification-admin":
15:37:29.766 STDERR terraform:   12: data "newrelic_entity" "notification-admin" {
15:37:29.766 STDERR terraform: Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
15:37:29.766 STDERR terraform:   with data.newrelic_entity.notification-api-k8s[0],
15:37:29.767 STDERR terraform:   on data.tf line 19, in data "newrelic_entity" "notification-api-k8s":
15:37:29.767 STDERR terraform:   19: data "newrelic_entity" "notification-api-k8s" {
15:37:29.949 ERROR  terraform invocation failed in ./.terragrunt-cache/LSjtUBYwy6sdqnASTiOnTk5WUmU/ziUKr5pa_JoeDZ3wgSbieuIpHJE/newrelic
15:37:29.949 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/LSjtUBYwy6sdqnASTiOnTk5WUmU/ziUKr5pa_JoeDZ3wgSbieuIpHJE/newrelic
  
  Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
  
    with data.newrelic_entity.notification-api-lambda[0],
    on data.tf line 1, in data "newrelic_entity" "notification-api-lambda":
     1: data "newrelic_entity" "notification-api-lambda" {
  
  
  Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
  
    with data.newrelic_entity.notification-admin[0],
    on data.tf line 12, in data "newrelic_entity" "notification-admin":
    12: data "newrelic_entity" "notification-admin" {
  
  
  Error: 401 response returned: Invalid credentials provided. Missing API key or an invalid API key was provided.
  
    with data.newrelic_entity.notification-api-k8s[0],
    on data.tf line 19, in data "newrelic_entity" "notification-api-k8s":
    19: data "newrelic_entity" "notification-api-k8s" {
  
  
  exit status 1


```

</details>

